{
  "backend/main.mo": "Motoko canister managing user profiles and listings with access control, CRUD operations, and query filters.",
  "feature_evidence.json": "Feature evidence report mapping three game‑loop and sprite‑loading fixes to affected frontend files and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files including styles, routing, hooks, components, and pages.",
  "frontend/index.css": "Tailwind base/theme variable overrides defining light/dark color tokens and global background/foreground styles.",
  "frontend/index.html": "Base HTML entry file loading the app root and main TSX module.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app in theme provider, profile setup dialog, and toaster.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with loading state, error handling, and query cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Route guard that shows a sign‑in prompt when the user is not authenticated.",
  "frontend/src/components/images/ImageUrlFields.tsx": "Empty placeholder file for image URL input fields.",
  "frontend/src/components/images/SafeImage.tsx": "Empty placeholder file for a safe image component.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer showing copyright and a caffeine.ai attribution link with dynamic hostname tracking.",
  "frontend/src/components/layout/AppHeader.tsx": "Responsive header with logo, navigation links, mobile sheet menu, and login button.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper including header, routed content outlet, and footer.",
  "frontend/src/components/listings/ListingCard.tsx": "Empty placeholder file for a listing card component.",
  "frontend/src/components/listings/ListingFilters.tsx": "Empty placeholder file for listing filter UI.",
  "frontend/src/components/listings/ListingForm.tsx": "Empty placeholder file for the listing creation/edit form.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Shows a dialog prompting authenticated users without a profile to enter a name and save it via a mutation.",
  "frontend/src/game/audio/useChiptuneLoop.ts": "Empty placeholder file with no implementation.",
  "frontend/src/game/audio/useMusicTrack.ts": "Hook that loads and loops a music track, handling play, pause, and muting based on state.",
  "frontend/src/game/audio/useSfx.ts": "Hook providing throttled sound‑effect playback with cached audio elements and mute support.",
  "frontend/src/game/constants.ts": "Defines grid, speed, scoring, spawn intervals, planet effects, and other core game constants.",
  "frontend/src/game/hooks/useGameLoop.ts": "Main game loop hook managing game state, sprite loading, input, spawning, and rendering logic.",
  "frontend/src/game/render/entities.ts": "Rendering helpers for snake, UFOs, cows, penguin bosses, and crocodiles using sprite sheets.",
  "frontend/src/game/render/obstacles.ts": "Re‑exports obstacle rendering helpers for UFOs, cows, and the penguin boss.",
  "frontend/src/game/render/sprites.ts": "Sprite manager that loads assets and provides functions to draw clipped or full sprites with pixel‑art settings.",
  "frontend/src/game/render/starfield.ts": "Creates and animates a twinkling starfield background with drifting stars.",
  "frontend/src/game/render/vfx.ts": "Renders laser beams and explosion animations using sprite sheets and timing.",
  "frontend/src/game/skins/catalog.ts": "Contains metadata for available snake skins including IDs, names, descriptions, and colors.",
  "frontend/src/game/types.ts": "Type definitions for directions, snake, obstacles, bosses, power‑ups, and overall game state.",
  "frontend/src/game/ui/ControlsHintOverlay.tsx": "UI overlay displaying keyboard, touch, and mouse control hints.",
  "frontend/src/game/ui/GameHUD.tsx": "Displays the player's score, level, and planet badges using styled UI components.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries on change.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns the current user's identity, profile, and authentication status using Internet Identity and profile queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling authentication, stored identity loading, and login state.",
  "frontend/src/hooks/useQueries.ts": "Defines queries and mutations for fetching and saving the current user's profile via the actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom space-themed color variables plus layout utilities.",
  "frontend/src/lib/imageUrl.ts": "Empty placeholder file.",
  "frontend/src/lib/listingImagesStore.ts": "Empty placeholder file.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/pages/BrowseListingsPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/EditListingPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero banner, navigation buttons, and feature descriptions for the game.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays a styled leaderboard using mock data and highlights top player rankings.",
  "frontend/src/pages/ListingDetailsPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/LobbyPage.tsx": "UI for selecting game modes, starting local play, and placeholder multiplayer lobby actions.",
  "frontend/src/pages/MyListingsPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/PlayPage.tsx": "Renders the main gameplay page, wiring up the canvas, game loop, audio, pause/mute controls, and loading/error overlays.",
  "frontend/src/pages/SellListingPage.tsx": "Empty placeholder page for selling listings, currently without implementation.",
  "frontend/src/pages/SkinsPage.tsx": "Displays available snake skins with previews, ownership state, and equip buttons, using placeholder ownership logic.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read, persist, and clear URL parameters and session-stored parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the frontend UI.",
  "project_state.json": "Tracks the project’s state, scope, requirements, issues, and architectural notes for the Spacecoco game."
}