{
  "backend/main.mo": "Motoko canister defining user profiles, listings, lobbies, and matches with access-controlled CRUD operations and sorting/filtering utilities.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, and test IDs with high-confidence metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend source files for reference or build planning.",
  "frontend/index.css": "Root Tailwind CSS file defining OKLCH-based theme variables and dark-mode overrides.",
  "frontend/index.html": "Base HTML template loading the React application entrypoint.",
  "frontend/src/App.tsx": "Main React app defining TanStack Router routes and global providers including theme, profile setup, and toasts.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth guard component showing a sign‑in prompt for unauthenticated users.",
  "frontend/src/components/background/CowNeonTrail.tsx": "Three.js component rendering a fading neon motion trail behind a moving 3D point.",
  "frontend/src/components/background/FlyingCowPBR.tsx": "Animated PBR‑textured flying cow model with circular motion and neon trail effects.",
  "frontend/src/components/background/MeteorConfettiField.tsx": "Spawns falling meteors that explode into short‑lived confetti particles, updating positions each frame. Renders both meteors and fading confetti meshes.",
  "frontend/src/components/background/NeonBackgroundLayer.tsx": "Wraps children with a WebGL‑based neon background, using lazy‑loaded 3D scene, error boundary, and fallback for non‑WebGL environments.",
  "frontend/src/components/background/NeonSpaceBackground3D.tsx": "Defines the full 3D neon space scene with stars, clouds, objects, lights, fog, and hue cycling. Renders multiple animated fields and effects inside a Three.js Canvas.",
  "frontend/src/components/background/NeonSpaceStars.tsx": "Generates moving neon‑colored stars with twinkling sizes and updates their positions each frame. Reports current star positions to a parent callback.",
  "frontend/src/components/background/PenguinShotField.tsx": "Periodically fires projectiles from penguin positions, updating movement and rendering fading smoke trails. Removes shots after a short lifespan.",
  "frontend/src/components/background/PixelCloudField.tsx": "Creates drifting, rotating pixel‑style cloud planes using a tiled texture. Clouds loop horizontally and animate based on speedMultiplier.",
  "frontend/src/components/background/StarExplosionField.tsx": "Spawns expanding rainbow ring explosions at star positions and updates shader‑driven animation until they fade out. Cleans up meshes when completed.",
  "frontend/src/components/background/UfoField3D.tsx": "Renders rotating UFO meshes and periodically spawns fading glint particles in a Three.js scene.",
  "frontend/src/components/background/useNeonHueCycle.ts": "Computes a smoothly interpolated neon color based on elapsed time cycling through a fixed palette.",
  "frontend/src/components/images/ImageUrlFields.tsx": "Empty placeholder file for image URL input components.",
  "frontend/src/components/images/SafeImage.tsx": "Empty placeholder file for a safe image display component.",
  "frontend/src/components/layout/AppFooter.tsx": "Displays footer with current year and a caffeinated attribution link.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with logo, navigation links, login button, and mobile sheet menu.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout wrapping header, footer, and routed content inside a neon background layer.",
  "frontend/src/components/listings/ListingCard.tsx": "Empty placeholder for a listing card component.",
  "frontend/src/components/listings/ListingFilters.tsx": "Empty placeholder for listing filter UI.",
  "frontend/src/components/listings/ListingForm.tsx": "Empty placeholder for a listing creation/edit form.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter a name and create their profile.",
  "frontend/src/components/start/NeonStartCoverOverlay.tsx": "Animated canvas shimmer overlay on top of a neon cover image with gradient shading.",
  "frontend/src/components/start/NeonStartScene.tsx": "Legacy animated 2D canvas scene with moving sprites and pulsing effects; kept for reference.",
  "frontend/src/game/audio/useAudioContextMusic.ts": "Manages Web Audio music playback, loading, context unlocking, looping, and reactive volume control.",
  "frontend/src/game/audio/useAudioContextSfx.ts": "React hook creating an AudioContext and custom synthesized SFX (hiss, boing, laser) with throttling and cleanup.",
  "frontend/src/game/audio/useBeatClock.ts": "Hook that tracks beat timing using AudioContext time and updates a beat phase via RAF scheduling.",
  "frontend/src/game/audio/useChiptuneLoop.ts": "Empty placeholder file for future chiptune loop hook.",
  "frontend/src/game/audio/useMusicTrack.ts": "Hook managing looping background music playback, volume, and mute state using an HTMLAudioElement.",
  "frontend/src/game/audio/useSfx.ts": "Hook for playing cached WAV SFX with throttling and optional stereo panning via Web Audio.",
  "frontend/src/game/constants.ts": "Defines grid, gameplay, scoring, spawn intervals, and planet configuration constants.",
  "frontend/src/game/hooks/useGameLoop.ts": "Large hook controlling game state, rendering, timing, obstacles, snakes, and intensity calculations.",
  "frontend/src/game/render/canvasDpr.ts": "Utilities for setting up high-DPI canvas scaling and retrieving logical canvas size.",
  "frontend/src/game/render/entities.ts": "Rendering functions for snakes and crocodiles with beat-synced and time‑based animation effects.",
  "frontend/src/game/render/obstacles.ts": "Rendering functions for obstacles like UFOs and cows, including beat‑synced motion, glow, and textures.",
  "frontend/src/game/render/sprites.ts": "Optional sprite loading system with no‑op loading and helper functions for drawing sprite images.",
  "frontend/src/game/render/starfield.ts": "Renders a starfield background with twinkling stars and periodic shooting stars using canvas.",
  "frontend/src/game/render/toonMaterials.ts": "Loads toon-style texture assets and defines material presets with colors, outlines, and glow settings.",
  "frontend/src/game/render/toonRenderer.ts": "Provides high-level toon rendering utilities including glow, outlines, gradients, and quality controls.",
  "frontend/src/game/render/vfx.ts": "Implements visual effects for lasers, explosions, and score popups using toon rendering.",
  "frontend/src/game/skins/catalog.ts": "Defines a catalog of snake skins with IDs, names, descriptions, and color palettes.",
  "frontend/src/game/types.ts": "Declares core game types including snakes, obstacles, power-ups, lasers, explosions, and game state.",
  "frontend/src/game/ui/ControlsHintOverlay.tsx": "UI overlay displaying control hints for keyboard, mobile, and gamepad inputs.",
  "frontend/src/game/ui/GameHUD.tsx": "HUD component showing score, level, eliminations, planet, and gravity mode.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides the authenticated user's identity, profile, and login state using Internet Identity and user profile queries.",
  "frontend/src/hooks/useDocumentVisibility.ts": "Tracks whether the browser tab is currently visible.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing identity, login, logout, and status using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving the caller's user profile via the backend actor.",
  "frontend/src/index.css": "Global Tailwind-based neon theme styles, including colors, fonts, utilities, and animations.",
  "frontend/src/lib/imageUrl.ts": "Empty placeholder file.",
  "frontend/src/lib/listingImagesStore.ts": "Empty placeholder file.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/motorSnake3d/audio/AudioDirector.ts": "Controls audio intensity states and triggers sound events based on gameplay intensity.",
  "frontend/src/motorSnake3d/input/useAnalogInput.ts": "Handles analog input from keyboard and joystick, providing movement, acceleration, brake, and shake states.",
  "frontend/src/motorSnake3d/input/VirtualJoystick.tsx": "Implements a touch-based virtual joystick that feeds normalized input to the analog input system.",
  "frontend/src/motorSnake3d/MotorSnakeGameRoot.tsx": "Sets up the 3D game canvas, game systems, HUD, inputs, and update loop for the MotorSnake game.",
  "frontend/src/motorSnake3d/multiplayer/MultiplayerBridge.ts": "Provides a bridge for submitting and receiving multiplayer actions, currently with placeholder logic.",
  "frontend/src/motorSnake3d/render/PlayerSnake3D.tsx": "Renders the player snake head and tail meshes and updates their positions and emissive pulse animations each frame.",
  "frontend/src/motorSnake3d/render/SphereWorld.tsx": "Draws the animated spherical world environment with breathing surfaces, pulsing core, shadow decals, and optional abyss tentacles.",
  "frontend/src/motorSnake3d/state/gameState.ts": "Defines the Zustand game state store including player, world, enemies, anomalies, power-ups, and associated mutation actions.",
  "frontend/src/motorSnake3d/systems/AnomalyPowerUpSystem.ts": "Spawns anomalies periodically and manages active power-up effects like blackhole suction and shooting star behavior.",
  "frontend/src/motorSnake3d/systems/CollisionSystem.ts": "Handles player collisions with enemies, anomalies, and the core, triggering effects, removing entities, and applying power-ups.",
  "frontend/src/motorSnake3d/systems/EnemySpawnerSystem.ts": "Periodically spawns random enemies and updates their positions based on velocity.",
  "frontend/src/motorSnake3d/systems/EnvironmentSystem.ts": "Controls gravity cycling, acid rain damage, wind portals, and fog intensity, triggering related visual effects.",
  "frontend/src/motorSnake3d/systems/GhostSystem.ts": "Manages ghost activation after death and increases ghost influence until player replacement triggers.",
  "frontend/src/motorSnake3d/systems/PlayerMotorSystem.ts": "Updates player movement using analog input, gravity scaling, penguin slowdowns, and optional aggressive motion effects.",
  "frontend/src/motorSnake3d/systems/TailSystem.ts": "Updates tail segments to follow the player, handles whip impulse and shaking to remove baby penguins, and supports segment removal.",
  "frontend/src/motorSnake3d/systems/WorldSystem.ts": "Constrains the player to inner or outer sphere surfaces, manages abyss mode pull and respawn, and toggles world mode.",
  "frontend/src/motorSnake3d/ui/DebugSpawnPanel.tsx": "UI panel for spawning enemies and anomalies with quick buttons and showing baby penguin count.",
  "frontend/src/motorSnake3d/ui/DebugWorldControls.tsx": "UI controls for toggling world mode and triggering a temporary core break/abyss event.",
  "frontend/src/motorSnake3d/ui/EnvironmentDebugPanel.tsx": "Adjusts gravity and fog, toggles shield, and triggers short acid rain events via UI.",
  "frontend/src/motorSnake3d/ui/GhostOverlayHUD.tsx": "Displays ghost influence HUD and temporary subtitle when ghost mode activates.",
  "frontend/src/motorSnake3d/ui/PowerUpStatusHUD.tsx": "Shows active power‑up name, progress bar, warning text, and remaining duration.",
  "frontend/src/motorSnake3d/vfx/effects/ConfettiBurstEffect.tsx": "Renders a short‑lived confetti particle burst with gravity and fade-out, cleaning resources on finish.",
  "frontend/src/motorSnake3d/vfx/effects/DiscoGlintEffect.tsx": "Spawns a glint plane moving in a direction, fading over time, and facing the camera.",
  "frontend/src/motorSnake3d/vfx/effects/PinkSmokeTrailEffect.tsx": "Renders a moving pink smoke trail by interpolating between two positions and fading sphere meshes over a short lifetime.",
  "frontend/src/motorSnake3d/vfx/effects/RainbowRingEffect.tsx": "Displays an expanding, fading rainbow ring billboarded to the camera, disposing its geometry and material when finished.",
  "frontend/src/motorSnake3d/vfx/useCameraShake.ts": "Provides a hook to trigger temporary camera shake by randomly offsetting the camera position with decay.",
  "frontend/src/motorSnake3d/vfx/VfxBus.ts": "Simple event bus for triggering and subscribing to VFX events with timestamps.",
  "frontend/src/motorSnake3d/vfx/VfxLayer3D.tsx": "Subscribes to VFX events and renders corresponding 3D effects, adding shake on eat hits.",
  "frontend/src/motorSnake3d/vfx/VfxScreenOverlay.tsx": "Displays a brief full‑screen color-wave overlay when eat-hit events occur.",
  "frontend/src/motorSnake3d/vfx/vfxSprites.ts": "Loads and caches VFX textures and exposes paths for several sprite assets.",
  "frontend/src/multiplayer/useLobby.ts": "Implements lobby creation, joining, leaving, and match starting with react-query polling for waiting lobbies.",
  "frontend/src/multiplayer/useMatchEvents.ts": "Handles match actions and match state polling plus a mutation for submitting player actions.",
  "frontend/src/pages/BrowseListingsPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/EditListingPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero section, navigation buttons, and feature cards for the game.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays a mock leaderboard with ranked entries and placeholders for user scores.",
  "frontend/src/pages/ListingDetailsPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/LobbyPage.tsx": "Lobby interface enabling solo play, lobby creation, and joining existing lobbies with authentication checks.",
  "frontend/src/pages/MyListingsPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/PlayPage.tsx": "Main gameplay page handling audio unlock, play/pause, mute, intensity, VFX triggers, and rendering the game container with navigation controls.",
  "frontend/src/pages/SellListingPage.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/pages/SkinsPage.tsx": "Renders a grid of snake skins with ownership state, previews, and equip buttons, using static placeholders for now.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and manipulating hash-based query strings.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom colors, fonts, animations, shadows, and content paths for the project.",
  "project_state.json": "Project state metadata describing requirements for generating and integrating a new animated neon cover image and related features."
}