{
  "backend/main.mo": "Main canister logic defining user profiles, listings, lobbies, and matches with access control and listing utilities.",
  "backend/migration.mo": "Migration module that maps old nextId to the new state and initializes nextLobbyId to zero.",
  "feature_evidence.json": "Feature evidence report listing features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind base layer defining light/dark theme CSS variables and global styling rules.",
  "frontend/index.html": "Base HTML document containing the root mount point and script entry for the frontend app.",
  "frontend/src/App.tsx": "Root React app configuring routes, global layout, theme provider, and profile/setup dialogs.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling auth flows and query cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth guard component that blocks access for unauthenticated users with a sign‑in prompt.",
  "frontend/src/components/background/FlyingCowPBR.tsx": "Three.js component rendering an animated PBR‑textured flying cow following a looping path.",
  "frontend/src/components/background/NeonBackgroundLayer.tsx": "Wraps app content with a WebGL-detected 3D neon background, falling back to a static background when needed using Suspense and an error boundary.",
  "frontend/src/components/background/NeonSpaceBackground3D.tsx": "Creates a Three.js scene with neon lighting, stars, pixel clouds, and animated cows, optimized with visibility-based rendering.",
  "frontend/src/components/background/NeonSpaceStars.tsx": "Renders drifting, twinkling neon-colored stars using a custom points geometry updated each frame.",
  "frontend/src/components/background/PixelCloudField.tsx": "Displays drifting rotating pixel-art cloud planes with additive blending and per-frame motion updates.",
  "frontend/src/components/images/ImageUrlFields.tsx": "Empty placeholder file for image URL-related components.",
  "frontend/src/components/images/SafeImage.tsx": "Empty placeholder file intended for a safe image-rendering component.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer showing copyright info and a link attribution including dynamic hostname tracking.",
  "frontend/src/components/layout/AppHeader.tsx": "Responsive header with logo, navigation links, login controls, and a mobile sheet menu.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout combining header, footer, routed content, and the global neon background layer.",
  "frontend/src/components/listings/ListingCard.tsx": "Empty placeholder for a listing card component.",
  "frontend/src/components/listings/ListingFilters.tsx": "Empty placeholder for listing filter controls.",
  "frontend/src/components/listings/ListingForm.tsx": "Empty placeholder for a listing creation/edit form.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to enter a name and saves their profile.",
  "frontend/src/components/start/NeonStartScene.tsx": "Deprecated 2D canvas scene rendering animated sprites like UFOs, cows, and sparks for a legacy start screen.",
  "frontend/src/game/audio/useAudioContextMusic.ts": "React hook managing streamed music via Web Audio API with intensity-based volume and playback control.",
  "frontend/src/game/audio/useAudioContextSfx.ts": "Web Audio–based SFX hook providing oscillator and filtered sound effects with throttling and cleanup.",
  "frontend/src/game/audio/useBeatClock.ts": "Beat clock hook that tracks beat phase and timing using AudioContext for rhythm‑synced effects.",
  "frontend/src/game/audio/useChiptuneLoop.ts": "Empty file placeholder for a future chiptune loop hook.",
  "frontend/src/game/audio/useMusicTrack.ts": "Simple HTMLAudioElement music hook controlling looped playback and mute handling.",
  "frontend/src/game/audio/useSfx.ts": "HTMLAudioElement‑based SFX system with caching, throttling, and optional stereo panning via Web Audio API.",
  "frontend/src/game/constants.ts": "Defines core game constants for grid layout, scoring, entity behavior, and planet effects.",
  "frontend/src/game/hooks/useGameLoop.ts": "Main game loop hook managing state updates, rendering, spawning, movement, and gameplay intensity.",
  "frontend/src/game/render/canvasDpr.ts": "Utility for setting canvas resolution based on device pixel ratio and retrieving logical size.",
  "frontend/src/game/render/entities.ts": "Rendering helpers for snakes and crocodiles with toon shading, animations, and beat‑synced effects.",
  "frontend/src/game/render/obstacles.ts": "Defines rendering routines for UFOs and cows using toon materials, glow effects, beat‑synced motion, and texture fallbacks.",
  "frontend/src/game/render/sprites.ts": "Provides optional sprite loading and helper functions to draw whole sprites or frames onto a canvas.",
  "frontend/src/game/render/starfield.ts": "Implements a starfield renderer with twinkling stars, a gradient background, and periodic shooting stars with glowing trails.",
  "frontend/src/game/render/toonMaterials.ts": "Loads toon texture assets and defines toon materials with colors, outlines, and glow properties for various objects.",
  "frontend/src/game/render/toonRenderer.ts": "Implements the core toon renderer, offering glow, outline, fill, and gradient utilities with adjustable quality settings.",
  "frontend/src/game/render/vfx.ts": "Renders laser beams, explosions, and score popups using layered glow, pulsing effects, and time‑based animation.",
  "frontend/src/game/skins/catalog.ts": "Defines a catalog of snake skins with IDs, names, descriptions, and color schemes.",
  "frontend/src/game/types.ts": "Defines TypeScript types for game entities including snakes, planets, power-ups, obstacles, bosses, and full game state.",
  "frontend/src/game/ui/ControlsHintOverlay.tsx": "Renders an overlay card showing keyboard, mobile, and gamepad control hints.",
  "frontend/src/game/ui/GameHUD.tsx": "Displays score, level, eliminations, and planet/gravity badges using game state data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes related queries when the actor changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns the current authenticated identity and user profile with loading and status flags.",
  "frontend/src/hooks/useDocumentVisibility.ts": "Tracks and returns whether the document is currently visible.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login/logout through AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving the caller's user profile via the backend actor.",
  "frontend/src/index.css": "Configures global Tailwind styles, theme variables, fonts, and neon-themed utility classes.",
  "frontend/src/lib/imageUrl.ts": "Empty placeholder file.",
  "frontend/src/lib/listingImagesStore.ts": "Empty placeholder file.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/motorSnake3d/audio/AudioDirector.ts": "Manages audio intensity states and triggers sound events based on gameplay intensity.",
  "frontend/src/motorSnake3d/input/useAnalogInput.ts": "Hook that merges keyboard and virtual joystick input into a normalized analog vector, acceleration, brake, and shake flags.",
  "frontend/src/motorSnake3d/input/VirtualJoystick.tsx": "Touch-only virtual joystick that tracks finger position, normalizes movement, and feeds analog input to the game.",
  "frontend/src/motorSnake3d/MotorSnakeGameRoot.tsx": "Sets up the 3D game canvas, game logic systems, virtual joystick, HUD overlays, and debug panels.",
  "frontend/src/motorSnake3d/multiplayer/MultiplayerBridge.ts": "Bridge for submitting local actions and logging remote actions, placeholder for multiplayer syncing.",
  "frontend/src/motorSnake3d/render/SphereWorld.tsx": "Three.js scene with rotating core, fog, sphere environment, and optional abyss tentacles.",
  "frontend/src/motorSnake3d/state/gameState.ts": "Zustand store defining all game entities, world settings, power-ups, and state mutation actions.",
  "frontend/src/motorSnake3d/systems/AnomalyPowerUpSystem.ts": "Spawns anomalies and updates active power-ups, applying effects like black hole suction and shooting star behavior.",
  "frontend/src/motorSnake3d/systems/CollisionSystem.ts": "Detects collisions with enemies, anomalies, and the core, triggering VFX, power-ups, or entity removal.",
  "frontend/src/motorSnake3d/systems/EnemySpawnerSystem.ts": "Periodically spawns enemies around the player and updates their movement based on velocity.",
  "frontend/src/motorSnake3d/systems/EnvironmentSystem.ts": "Cycles gravity, applies acid rain damage, and manages wind portals and fog intensity changes.",
  "frontend/src/motorSnake3d/systems/GhostSystem.ts": "Tracks ghost activation after player deaths and increases its influence until replacement triggers.",
  "frontend/src/motorSnake3d/systems/PlayerMotorSystem.ts": "Updates player velocity and position using analog input, speed modifiers, smoothing, and aggressive movement behavior.",
  "frontend/src/motorSnake3d/systems/TailSystem.ts": "Updates tail segments to follow the player, handles whip impulse, and removes baby penguins on shake.",
  "frontend/src/motorSnake3d/systems/WorldSystem.ts": "Constrains the player to inside/outside sphere surfaces and manages abyss mode and core break events.",
  "frontend/src/motorSnake3d/ui/DebugSpawnPanel.tsx": "UI panel for spawning enemies and anomalies and displaying baby penguin count.",
  "frontend/src/motorSnake3d/ui/DebugWorldControls.tsx": "UI for toggling world mode and triggering a core break with automatic recovery.",
  "frontend/src/motorSnake3d/ui/EnvironmentDebugPanel.tsx": "Debug UI for gravity readout, fog adjustment, acid rain trigger, and shield toggling.",
  "frontend/src/motorSnake3d/ui/GhostOverlayHUD.tsx": "Displays ghost influence meter and a temporary subtitle when the ghost activates.",
  "frontend/src/motorSnake3d/ui/PowerUpStatusHUD.tsx": "Shows active power‑up info, progress bar, warnings, and remaining duration.",
  "frontend/src/motorSnake3d/vfx/VfxBus.ts": "Simple event bus for triggering VFX events with listeners.",
  "frontend/src/motorSnake3d/vfx/VfxLayer3D.tsx": "Renders temporary 3D visual effects in response to VFX bus events.",
  "frontend/src/multiplayer/useLobby.ts": "React hooks for creating, joining, leaving, and polling lobbies via backend actor.",
  "frontend/src/multiplayer/useMatchEvents.ts": "Handles sending match actions and polling match state and action history.",
  "frontend/src/pages/BrowseListingsPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/EditListingPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero section, navigation buttons, and feature descriptions for the game.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays a mock leaderboard with top player rankings, icons, and a placeholder for personal best scores.",
  "frontend/src/pages/ListingDetailsPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/LobbyPage.tsx": "Provides UI for starting solo play, creating or joining multiplayer lobbies, and viewing available lobbies.",
  "frontend/src/pages/MyListingsPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/PlayPage.tsx": "Renders the main game view with audio controls, pause/resume logic, and multiplayer event handling.",
  "frontend/src/pages/SellListingPage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/SkinsPage.tsx": "Shows a grid of snake skins with ownership and equip states, using mock data and placeholder backend integration.",
  "frontend/src/utils/urlParams.ts": "Utility methods for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended fonts, colors, shadows, animations, and plugin integration.",
  "project_state.json": "Defines project goals for rebuilding a new 3D Motor Snake game with spherical world, async multiplayer, and environmental systems, while noting prior deployment issues. Lists existing features, requirements, and architectural notes guiding the foundational redesign."
}