{
  "backend/main.mo": "Motoko canister implementing user profiles and marketplace listings with access control, CRUD operations, and multiple filtered listing queries.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to impacted files, components, and test references for the game project.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files including components, pages, hooks, and style configuration.",
  "frontend/index.css": "Tailwind base/theme variable setup defining OKLCH color tokens and dark-mode overrides for global styling.",
  "frontend/index.html": "Root HTML document mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, wraps the app in ThemeProvider, and renders global UI utilities like ProfileSetupDialog and Toaster.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states, error recovery, and React Query cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Route guard that blocks unauthenticated users and shows a sign‑in required card with navigation back to home.",
  "frontend/src/components/images/ImageUrlFields.tsx": "Empty placeholder file for image URL form fields.",
  "frontend/src/components/images/SafeImage.tsx": "Empty placeholder file for a safe image component.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer showing copyright and a caffeine.ai attribution link with dynamic UTM parameters.",
  "frontend/src/components/layout/AppHeader.tsx": "Responsive header with logo, navigation links, login button, and mobile sheet menu.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, footer, and routed content.",
  "frontend/src/components/listings/ListingCard.tsx": "Empty file.",
  "frontend/src/components/listings/ListingFilters.tsx": "Empty file.",
  "frontend/src/components/listings/ListingForm.tsx": "Empty file.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Shows a dialog for new users to enter their name and creates their profile via a mutation.",
  "frontend/src/game/audio/useChiptuneLoop.ts": "React hook that initializes a Web Audio oscillator and plays a looping chiptune melody when enabled.",
  "frontend/src/game/constants.ts": "Defines grid, speed, scoring, spawn intervals, and planetary effect constants for the game.",
  "frontend/src/game/hooks/useGameLoop.ts": "Manages game state, timing, rendering, and spawning logic for the main Snake-like game loop.",
  "frontend/src/game/render/obstacles.ts": "Provides canvas rendering helpers for UFOs, cows, and the penguin boss.",
  "frontend/src/game/render/starfield.ts": "Implements an animated starfield background renderer with twinkling and drifting stars.",
  "frontend/src/game/skins/catalog.ts": "Exports a catalog of snake skins with IDs, names, descriptions, and color schemes.",
  "frontend/src/game/types.ts": "Defines TypeScript types for directions, game entities, obstacles, power-ups, bosses, and game state.",
  "frontend/src/game/ui/ControlsHintOverlay.tsx": "Displays a small overlay showing keyboard, touch, and mouse control hints.",
  "frontend/src/game/ui/GameHUD.tsx": "Shows score, level, and planet/gravity status in a styled HUD card.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Combines identity and user profile query to expose current user state and authentication info.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling AuthClient setup, login, logout, and exposing identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for loading and saving the caller's user profile through the backend actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining a cosmic color theme, fonts, and shared component classes.",
  "frontend/src/lib/imageUrl.ts": "Empty file.",
  "frontend/src/lib/listingImagesStore.ts": "Empty file.",
  "frontend/src/main.tsx": "App entry initializing React, React Query, and Internet Identity provider before rendering the main App.",
  "frontend/src/pages/BrowseListingsPage.tsx": "Empty file.",
  "frontend/src/pages/EditListingPage.tsx": "Empty file.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature cards, and navigation buttons for gameplay and leaderboard.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays a mock leaderboard with styled cards and placeholders for future user-linked scoring.",
  "frontend/src/pages/ListingDetailsPage.tsx": "Empty file.",
  "frontend/src/pages/LobbyPage.tsx": "UI for selecting local or multiplayer modes with placeholders for lobby creation and joining.",
  "frontend/src/pages/MyListingsPage.tsx": "Empty file.",
  "frontend/src/pages/PlayPage.tsx": "Runs the game loop with canvas rendering, HUD, audio controls, pause handling, and game over overlay.",
  "frontend/src/pages/SellListingPage.tsx": "Empty file.",
  "frontend/src/pages/SkinsPage.tsx": "Renders the skins selection UI with preview cards, showing owned and active skins; backend integration for ownership is pending.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including colors, typography, animations, and container settings.",
  "project_state.json": "Stores the project’s current state, including Spacecoco’s goals, architecture notes, features, and versioning metadata."
}