{
  "backend/main.mo": "Implements user profiles and listings with access control, supporting CRUD operations and filtered queries.",
  "feature_evidence.json": "Lists feature evidence entries linking features to source files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for numerous frontend files to assist build planning.",
  "frontend/index.css": "Defines Tailwind base styles and light/dark theme CSS variables for the app.",
  "frontend/index.html": "HTML entry point mounting the app root and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with theme, profile setup, and toaster providers.",
  "frontend/src/components/auth/LoginButton.tsx": "UI button handling Internet Identity login/logout with loading and error handling.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth guard component that blocks access to protected pages and shows a sign‑in prompt.",
  "frontend/src/components/images/ImageUrlFields.tsx": "Empty placeholder file for image URL form fields.",
  "frontend/src/components/images/SafeImage.tsx": "Empty placeholder file for a safe image rendering component.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer showing copyright and a caffeine.ai attribution link with dynamic tracking.",
  "frontend/src/components/layout/AppHeader.tsx": "Responsive header with logo, navigation links, login button, and mobile sheet menu.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps the app with header, footer, and an Outlet inside a flex column layout.",
  "frontend/src/components/listings/ListingCard.tsx": "Empty file with no implemented component.",
  "frontend/src/components/listings/ListingFilters.tsx": "Empty file with no implemented component.",
  "frontend/src/components/listings/ListingForm.tsx": "Empty file with no implemented component.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal prompting new authenticated users to enter their name and save a profile via mutation.",
  "frontend/src/components/start/NeonStartScene.tsx": "Animated canvas scene rendering neon UFOs, cows, sparks, and a banner using sprite images.",
  "frontend/src/game/audio/useAudioContextMusic.ts": "Hook managing Web Audio API music playback, buffering, unlock handling, and dynamic gain updates.",
  "frontend/src/game/audio/useAudioContextSfx.ts": "Hook providing synthesized SFX (hiss, boing, laser buzz) using OscillatorNodes with throttling and cleanup.",
  "frontend/src/game/audio/useBeatClock.ts": "Generates beat phase timing synced with an AudioContext using a scheduled animation loop.",
  "frontend/src/game/audio/useChiptuneLoop.ts": "Empty file with no implemented hook.",
  "frontend/src/game/audio/useMusicTrack.ts": "Simple audio element–based music playback hook handling looping, play/pause, and mute state.",
  "frontend/src/game/audio/useSfx.ts": "Plays cached HTMLAudioElement-based sound effects with throttle control and stereo panning.",
  "frontend/src/game/constants.ts": "Defines canvas, grid, scoring, spawn intervals, and planet effect constants for the game.",
  "frontend/src/game/hooks/useGameLoop.ts": "Defines the main game loop hook, initializes state, updates gameplay intensity, and manages rendering and timing refs.",
  "frontend/src/game/render/canvasDpr.ts": "Provides utilities to set up canvas device pixel ratio scaling and retrieve logical canvas size.",
  "frontend/src/game/render/entities.ts": "Renders snakes and crocodiles with toon materials, wave animation, and tongue effects.",
  "frontend/src/game/render/obstacles.ts": "Renders UFOs, cows, and penguin bosses with toon shading, textures, drift, glow, and fallback visuals.",
  "frontend/src/game/render/sprites.ts": "Handles optional sprite loading and provides helpers to draw sprites and animation frames.",
  "frontend/src/game/render/starfield.ts": "Implements animated starfield background with twinkling stars and periodic shooting stars.",
  "frontend/src/game/render/toonMaterials.ts": "Loads toon texture assets and defines material presets for various entities and obstacles.",
  "frontend/src/game/render/toonRenderer.ts": "Implements a Canvas-based toon renderer with glow, outline, gradient shading, and circle entity drawing utilities.",
  "frontend/src/game/render/vfx.ts": "Provides rendering functions for laser beams, explosions, and score popups using the ToonRenderer.",
  "frontend/src/game/skins/catalog.ts": "Defines the SnakeSkin interface and a list of preset snake skins with names, descriptions, and color palettes.",
  "frontend/src/game/types.ts": "Declares core game types including snake, power-ups, obstacles, bosses, and overall GameState structure.",
  "frontend/src/game/ui/ControlsHintOverlay.tsx": "Renders an overlay showing control hints for keyboard, touch, and mouse inputs.",
  "frontend/src/game/ui/GameHUD.tsx": "Displays score, level, eliminations, and planet/gravity badges in the in-game HUD.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns the current user’s identity, profile, and authentication state using Internet Identity and profile queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication state and login flows.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and saving the caller’s user profile via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, theme color variables, dark mode overrides, and custom neon-style utility classes for the UI.",
  "frontend/src/lib/imageUrl.ts": "Empty placeholder file for image URL utilities.",
  "frontend/src/lib/listingImagesStore.ts": "Empty placeholder file for an image listing store.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/BrowseListingsPage.tsx": "Empty placeholder page for browsing listings.",
  "frontend/src/pages/EditListingPage.tsx": "Empty placeholder page for editing listings.",
  "frontend/src/pages/HomePage.tsx": "Renders the neon-styled landing page with hero section, navigation buttons, and feature cards.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays a styled leaderboard using mock data with rank icons and player stats.",
  "frontend/src/pages/ListingDetailsPage.tsx": "Empty placeholder page for showing listing details.",
  "frontend/src/pages/LobbyPage.tsx": "Shows local and multiplayer lobby UI with neon styling and placeholders for multiplayer actions.",
  "frontend/src/pages/MyListingsPage.tsx": "Empty placeholder page for displaying user listings.",
  "frontend/src/pages/PlayPage.tsx": "Implements the main game page with canvas, audio handling, game loop hooks, and UI controls.",
  "frontend/src/pages/SellListingPage.tsx": "Empty placeholder page for creating a new listing.",
  "frontend/src/pages/SkinsPage.tsx": "Displays available snake skins, ownership state, and UI for selecting or unlocking skins.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash), persist them in sessionStorage, and clear them from either storage or the URL hash.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration with custom colors, fonts, animations, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s current state, goals, art direction changes, gameplay requirements, and known issues for the Spacecoco web game."
}