{
  "backend/main.mo": "Motoko canister managing user profiles and marketplace-style listings with authorization checks, creation, filtering, and search.",
  "feature_evidence.json": "Feature evidence report mapping product features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend files across components, pages, and utilities.",
  "frontend/index.css": "Defines global Tailwind layers and CSS variables for light/dark themes with a neon‑styled palette.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with ThemeProvider, profile setup, and toast system.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and cache clearing.",
  "frontend/src/components/auth/RequireAuth.tsx": "Auth guard that blocks access for unauthenticated users and shows a sign‑in required card.",
  "frontend/src/components/images/ImageUrlFields.tsx": "Empty placeholder file for image URL form field components.",
  "frontend/src/components/images/SafeImage.tsx": "Empty placeholder file for a safe image rendering component.",
  "frontend/src/components/layout/AppFooter.tsx": "Footer displaying copyright, branding, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation bar with logo, links, login button, and responsive mobile sheet menu.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines a page layout with header, footer, and routed content via Outlet.",
  "frontend/src/components/listings/ListingCard.tsx": "Empty file; no implementation provided.",
  "frontend/src/components/listings/ListingFilters.tsx": "Empty file; no implementation provided.",
  "frontend/src/components/listings/ListingForm.tsx": "Empty file; no implementation provided.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to enter their name and saves the profile.",
  "frontend/src/components/start/NeonStartScene.tsx": "Renders an animated neon space scene on a canvas with UFOs, cows, sparks, and a banner.",
  "frontend/src/game/audio/useChiptuneLoop.ts": "Empty file; no implementation provided.",
  "frontend/src/game/audio/useMusicTrack.ts": "Hook that loads and controls looping background music with mute and play state handling.",
  "frontend/src/game/audio/useSfx.ts": "Hook providing throttled spatialized sound effects with caching and stereo panning.",
  "frontend/src/game/constants.ts": "Defines grid, speed, scoring, spawn intervals, and planet effect constants for the game.",
  "frontend/src/game/hooks/useGameLoop.ts": "Main game loop hook handling state updates, sprite loading, spawns, input, and rendering.",
  "frontend/src/game/render/entities.ts": "Rendering helpers for snakes and crocodiles using sprite sheets and glow effects.",
  "frontend/src/game/render/obstacles.ts": "Rendering functions for UFOs, cows, penguin bosses, and point drops with glow effects.",
  "frontend/src/game/render/sprites.ts": "Sprite manager for loading and drawing pixel-art sprites with smoothing disabled.",
  "frontend/src/game/render/starfield.ts": "Animated starfield renderer producing twinkling drifting stars for backgrounds.",
  "frontend/src/game/render/vfx.ts": "Implements canvas rendering for laser beams, explosion animations, and floating score popups with glow effects.",
  "frontend/src/game/skins/catalog.ts": "Defines snake skin metadata and exports a list of preset skins with names, descriptions, and colors.",
  "frontend/src/game/types.ts": "Contains shared game TypeScript types for snakes, power-ups, obstacles, bosses, VFX, and overall game state.",
  "frontend/src/game/ui/ControlsHintOverlay.tsx": "Renders a small UI overlay showing keyboard, touch, and mouse control hints.",
  "frontend/src/game/ui/GameHUD.tsx": "Displays score, level, eliminations, and planet/gravity badges using game state data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides current user identity, profile, and authentication state by combining identity and profile queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login handling, stored identity loading, and related React hooks.",
  "frontend/src/hooks/useQueries.ts": "Provides react-query hooks for fetching and saving the caller's user profile using the actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom neon-themed UI variables and utility classes.",
  "frontend/src/lib/imageUrl.ts": "Empty placeholder file.",
  "frontend/src/lib/listingImagesStore.ts": "Empty placeholder file.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/BrowseListingsPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/EditListingPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing a neon hero section, game intro, and feature cards with navigation to lobby and leaderboard.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays a mock leaderboard with ranked player stats and placeholders for future account-linked scores.",
  "frontend/src/pages/ListingDetailsPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/LobbyPage.tsx": "Provides UI for selecting local or multiplayer modes, creating or joining lobbies, and starting local games.",
  "frontend/src/pages/MyListingsPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/PlayPage.tsx": "Runs the main game loop with canvas rendering, HUD, audio controls, and pause/play logic based on loaded sprites.",
  "frontend/src/pages/SellListingPage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/SkinsPage.tsx": "Displays snake skins with ownership and equip UI, using a catalog and placeholders for future backend integration.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and persisting URL parameters with sessionStorage and hash support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending fonts, colors, shadows, animations, and container settings with plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing the Spacecoco project's current state, including game vision, architectural notes, required assets, and known issues."
}