{
  "kind": "build_request",
  "title": "Fix Spacecoco blank Play screen by starting the game loop correctly after sprite load",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-29",
      "text": "Fix the Play screen blank/no-render issue by ensuring the requestAnimationFrame game loop actually starts after sprites finish loading (avoid stale React hook closures). In particular, `startGame()` and `resumeGame()` must invoke a `gameLoop` function that sees the latest `spritesLoaded` value and does not early-return incorrectly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "ni siquiera aparece nada",
          "solo as lo que tengas que hacer para que el juego funcione al 100%"
        ]
      },
      "acceptanceCriteria": [
        "When navigating to /play from the Lobby, the canvas renders the starfield + snake within 1 second after assets load.",
        "The snake is always moving without requiring any user input.",
        "Pausing and resuming reliably restarts the animation loop and rendering (no freeze/blank screen after resume).",
        "There are no React console warnings about missing hook dependencies for the game loop start/resume logic."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Add a robust runtime fallback so the Play screen is never fully blank if sprite loading fails: surface a user-visible error overlay with an actionable message and ensure at least a minimal canvas render (e.g., clear + starfield) still occurs even when `loadAllSprites()` rejects.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7"
        ],
        "quotes": [
          "nada se mueve sabes porque?",
          "ni siquiera aparece nada"
        ]
      },
      "acceptanceCriteria": [
        "If any sprite fails to load, the UI shows an overlay on the Play screen indicating that assets failed to load (English text) rather than leaving a blank screen.",
        "The failure state is logged to console with the underlying error.",
        "The user can still navigate back to the Lobby from the Play screen in the failure state."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Verify and correct the runtime sprite asset paths used by the sprite loader so they resolve in production (IC canister hosting) and allow `spritesLoaded` to become true when the assets exist under `frontend/public/assets/generated`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-10"
        ],
        "quotes": [
          "nada se mueve sabes porque?",
          "ni siquiera aparece nada"
        ]
      },
      "acceptanceCriteria": [
        "In production build, `loadAllSprites()` resolves successfully and `spritesLoaded` becomes true when the expected files exist under `/assets/generated/`.",
        "The “Loading Game Assets…” overlay disappears once sprites are loaded, and gameplay starts automatically.",
        "No 404s are emitted in the browser network panel for the sprite asset URLs referenced by the sprite loader."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under the immutable frontend paths listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useActor.ts`, `frontend/src/components/ui`).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding new gameplay features (boss logic changes, new power-ups, multiplayer sync) beyond what is required to make rendering/movement work again.",
    "Backend/canister changes in Motoko unless a frontend fix cannot resolve the blank screen issue."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}