{
  "kind": "build_request",
  "title": "Generate and integrate a full-screen animated neon cover image for the game start screen",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Generate a new hyperreal modern-cartoon, cinematic neon cover image matching the user’s provided scene description (colossal neon green/purple snake biting a splitting silver UFO with a screaming green alien inside; smaller snakes stampeding in the foreground with glowing trails; a flying cow on the right shooting red laser beams with smoke; rotating starfield background; sparks/fire/color explosions; volumetric lighting; depth of field; long shadows). Save it as a static asset in the frontend public generated assets folder.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Portada hiperrealista en estilo caricatura moderna, ultra detallada, con render cinematográfico... Resolución 8K, ultra cinematográfica.",
          "agregalo a mi juego",
          "que la imagine cubra toda la pantalla, que se mueva y brille con colores neon  y que remplace la imagen que ya esta",
          "comienza ya"
        ]
      },
      "acceptanceCriteria": [
        "A new image file exists at frontend/public/assets/generated/game-cover-neon-snake-ufo.dim_3840x2160.png.",
        "The image visually includes all key elements described by the user (snake + UFO split + alien, foreground smaller snakes with trails, flying cow with red lasers + smoke, rotating starfield feel, sparks/fire/explosive color, cinematic lighting/DOF).",
        "The asset is referenced via a plain static URL path starting with /assets/generated/ (no backend image serving)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the current start/cover artwork with the new cover image and present it as a full-screen start overlay on the Play page. The cover must fill the viewport (cover sizing), and include a subtle animated neon glow + motion treatment (e.g., slow parallax drift/zoom, hue-shift shimmer, and/or animated light sweep) while keeping UI readable and clickable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "que la imagine cubra toda la pantalla, que se mueva y brille con colores neon  y que remplace la imagen que ya esta"
        ]
      },
      "acceptanceCriteria": [
        "On /play when the game has not started yet, the user sees a full-viewport cover background using /assets/generated/game-cover-neon-snake-ufo.dim_3840x2160.png.",
        "The cover is animated (visible motion over time) and has a neon glow/shimmer effect; animation does not block button interactions.",
        "Existing start UI (title/description/start button) remains readable on top of the cover via an overlay/gradient/backdrop treatment.",
        "The previous start/cover background used in this state is no longer visible."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Home page hero artwork to use the new cover image instead of the current generated hero image, keeping responsive layout intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "que ... remplace la imagen que ya esta"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/pages/HomePage.tsx no longer references /assets/generated/spacecoco-hero-neon-cartoon.dim_1600x600.png.",
        "The Home page hero image displays /assets/generated/game-cover-neon-snake-ufo.dim_3840x2160.png and remains properly styled (no layout break on desktop)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only shadcn components).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Do not route generated images through the backend; serve them as static assets from frontend/public/assets/generated."
  ],
  "nonGoals": [
    "Do not change gameplay mechanics, scoring, spawning, or physics.",
    "Do not add new authentication providers beyond Internet Identity.",
    "Do not implement real-time networking changes (WebSockets, etc.)."
  ],
  "imageRequirements": {
    "required": [
      "Hyperreal modern-cartoon cinematic neon cover art featuring: colossal neon green/purple snake biting a splitting silver UFO with a screaming green alien inside; foreground stampede of smaller snakes with glowing trails; flying cow with red laser eyes and smoky beams; rotating starfield; sparks/fire/explosive colors; volumetric lighting; depth of field; long shadows (game-cover-neon-snake-ufo.dim_3840x2160.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for user-facing text in the app."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}