{
  "kind": "build_request",
  "title": "Implement immediate AudioContext init, 60fps focus-safe loop, crisp 4K canvas rendering, and non-generic character silhouettes",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-48",
      "text": "Initialize WebAudio (AudioContext) at the earliest possible time in the Play screen lifecycle and ensure audio playback is started from a user gesture on mobile without breaking the existing mute toggle behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "AudioContext ON desde el primer frame.\n...Y si es móvil, userGestureRequired = true;—que no se coma el mute.",
          "si aslo ya"
        ]
      },
      "acceptanceCriteria": [
        "When the Play screen mounts, an AudioContext is created (or prepared) immediately, but actual playback only starts after a user gesture if required by the platform/browser.",
        "Toggling mute always silences music and SFX immediately and reliably, including on mobile where audio requires a user gesture to begin.",
        "No audio-start logic is executed from a per-frame render loop; audio start/stop is triggered by lifecycle/state transitions (e.g., start/resume/pause/mute) rather than every frame."
      ]
    },
    {
      "id": "REQ-49",
      "text": "Enforce a stable 60fps game loop target and add focus/visibility handling so the game loop is paused/stopped when the tab/app loses focus and is resumed when focus returns, without causing blank renders or duplicated loops.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Todo en 60fps:\nframeRate(60); y si se cae, noLoop() y loop() cuando vuelva el foco.",
          "si aslo ya"
        ]
      },
      "acceptanceCriteria": [
        "The Play screen runs updates/renders via requestAnimationFrame with a 60fps target (where the browser allows).",
        "On document visibility change (hidden) and/or window blur, the game loop stops (no accumulating RAF callbacks), and on visibility/focus return it resumes cleanly.",
        "After multiple hide/show cycles, there is still exactly one active RAF loop and gameplay continues from the same paused/unpaused state as intended (no speedup, no freeze, no blank canvas)."
      ]
    },
    {
      "id": "REQ-50",
      "text": "Make Play screen canvas rendering crisp on high-DPI and 4K displays by rendering at devicePixelRatio-scaled resolution (clamped to a reasonable maximum such as 2) and applying correct image smoothing settings for vector/toon rendering vs any bitmap textures/sprites used.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Se mira para chingado:\npixelDensity(2); si es 4K.\nimageMode(CENTER); smooth();\nSi usas loadImage(), pon noSmooth()—si no, se ve borroso.",
          "si aslo ya"
        ]
      },
      "acceptanceCriteria": [
        "On high-DPI displays, the canvas backing resolution scales with devicePixelRatio (with an upper clamp so performance stays stable), while CSS size remains consistent.",
        "Toon/vector-style primitives remain smooth (no jagged edges) at high DPI.",
        "If any bitmap textures/sprite images are rendered, the appropriate image smoothing setting is applied so they are not blurred unintentionally.",
        "The visual result is measurably sharper than a non-DPR-scaled canvas (text and outlines are crisp, no ‘soft’ look)."
      ]
    },
    {
      "id": "REQ-51",
      "text": "Replace overly-generic ‘circle/blob’ visuals for key entities (Penguin boss, UFO, aliens/pilots) with clearer silhouettes and readable character details while keeping the existing Spacecoco toon renderer style and gameplay rules intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "no quiero que se miren círculos y bolas arriba de otra bola, quiero que se mire, que se distinga que son pingüinos, que se distingue que son alienígenas, que es una nave espacial volando a un lado con rayos láseres",
          "si aslo ya"
        ]
      },
      "acceptanceCriteria": [
        "Penguin boss rendering is updated so it reads clearly as a penguin (distinct head/body separation, beak/eyes/flippers silhouette cues) rather than a single circle entity.",
        "UFO rendering is updated so it reads clearly as a spacecraft (distinct hull/dome/lights cues) rather than a plain ellipse, while preserving the existing glow treatment and drift motion.",
        "Alien presence is represented visually (e.g., an alien pilot visible in/near the UFO or as a distinct rendered feature) using original artwork (no third-party copyrighted characters).",
        "Entities remain readable over the starfield and VFX; silhouettes are recognizable at typical gameplay zoom.",
        "All user-facing UI text remains in English (no new Spanish UI text introduced)."
      ]
    },
    {
      "id": "REQ-52",
      "text": "Generate and include new high-detail toon textures needed to support the improved, non-generic entity silhouettes, place them under frontend/public/assets/generated, and wire them into the existing toon texture loader/rendering pipeline.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Quiero que se mire... que se distinga que son pingüinos... alienígenas... una nave espacial... con rayos láseres",
          "si aslo ya"
        ]
      },
      "acceptanceCriteria": [
        "New/updated textures are added under frontend/public/assets/generated and load successfully via the existing texture loader paths used at runtime.",
        "If textures fail to load, the game still renders (fallback rendering remains functional) and the Play screen is never fully blank.",
        "No backend image serving is introduced; all new art is shipped as static frontend assets."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Keep all user-facing UI text in English.",
    "Do not introduce third-party copyrighted characters or assets (e.g., do not ship “Baby Yoda / Grogu” imagery); use original, Spacecoco-appropriate alien characters instead.",
    "Frontend-only changes for this request; do not change Motoko backend state/schema."
  ],
  "nonGoals": [
    "Implementing p5.js APIs (e.g., pixelDensity(), smooth(), noLoop()) literally; only replicate the intent within the current React/canvas/toon-renderer architecture.",
    "Adding new gameplay mechanics beyond visual readability and the loop/audio initialization behavior described.",
    "Adding third-party authentication or external asset hosting/CDNs."
  ],
  "imageRequirements": {
    "required": [
      "Toon-style UFO exterior texture with clear hull + dome + accent lights (ufo-toon-albedo-v2.dim_4096x4096.png)",
      "Toon-style penguin boss texture with clear beak/eyes/flippers silhouette cues (penguin-toon-albedo-v2.dim_4096x4096.png)",
      "Toon-style alien pilot/character texture (alien-pilot-toon-albedo.dim_4096x4096.png)",
      "Toon-style emissive light accents/decals sheet for UFO windows/controls (ufo-decals-emissive.dim_2048x2048.png)"
    ],
    "edits": [
      "Improve silhouette/detail while preserving toon shading (ufo-toon-albedo.dim_4096x4096.png > ufo-toon-albedo-v2.dim_4096x4096.png)",
      "Improve silhouette/detail while preserving toon shading (penguin-toon-albedo.dim_4096x4096.png > penguin-toon-albedo-v2.dim_4096x4096.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Prefer crisp high-DPI/4K canvas rendering (DPR-scaled) and stable 60fps loop behavior with focus-safe pause/resume.",
      "Prefer AudioContext to be initialized immediately, but started via user gesture on mobile without breaking mute behavior.",
      "Prefer non-generic, readable character silhouettes for penguins/aliens/UFOs (no blob/circle placeholders)."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}