{
  "kind": "build_request",
  "title": "Integrate smooth flying cows, UFO push interactions, and UFO spotlights into existing 3D intro scene",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Update the existing intro/hero 3D scene so that all cows drift smoothly across the screen in continuous motion and never collide with (or overlap) each other, while preserving the current scene/theme and overall look.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "ahora as que las vacas vuelen suavemente por toda la pantalla sin tocarse",
          "si agregalo al tema existente sin altéralos lo ya echo",
          "comienza ya"
        ]
      },
      "acceptanceCriteria": [
        "Cows move with smooth, continuous motion across the visible intro scene area (no jittery/teleporting movement).",
        "Cows do not intersect/overlap each other during runtime (visual non-collision between cows).",
        "Existing intro scene theme/style remains intact (no broad color/theme redesign)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Implement UFO-to-cow interactions in the existing intro/hero 3D scene so that UFOs are the only objects that can ‘collide’ with cows: UFOs dart through quickly and physically push cows into new directions with a realistic-feeling impulse response, without enabling cow-vs-cow collisions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-3"
        ],
        "quotes": [
          "que lo único que pasa tocando las vacas sea los ovnis pasando rápido y haciendo que la vaca vuele a otro lado mecánica muy real",
          "si agregalo al tema existente sin altéralos lo ya echo"
        ]
      },
      "acceptanceCriteria": [
        "UFOs have occasional fast pass-through/dart motion events that bring them close enough to affect cows.",
        "When a UFO pass intersects a cow’s influence/collision radius, that cow’s trajectory changes immediately via an impulse-like push (direction and magnitude feel physical rather than scripted snapping).",
        "Cow-vs-cow interaction remains disabled (cows never push/bounce off each other)."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add periodic ‘cow reaction’ behavior to the intro/hero 3D scene approximately every 3 seconds (per cow or globally, but consistently timed), visible as secondary animation/pose response to the ongoing motion and/or recent UFO pushes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "co reacciones de las vacas cada 3 segundos"
        ]
      },
      "acceptanceCriteria": [
        "A clearly visible cow reaction animation/behavior triggers on an approximately 3-second cadence during the intro scene.",
        "Reactions do not break the cows’ smooth flight motion (they layer on top of the base movement).",
        "Reactions remain stable under varying frame rates (timing based on elapsed time, not frame count)."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Enhance UFO lighting in the intro/hero 3D scene by adding high-contrast white lights positioned at the front and underside of each UFO, oriented toward nearby cows, and ensure the lighting reads as high-quality 3D (clean contrast against the UFO body) without changing the existing game theme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-3"
        ],
        "quotes": [
          "también agrega luz blanca al frente y abajo de los ovnis que están dirigiendo las luces hacia  las vacas que la luz se contraste perfectamente con el ovni que se mire bien echo 3d de muy buena calidad sin cambiar nada del tema del juego",
          "si agregalo al tema existente sin altéralos lo ya echo"
        ]
      },
      "acceptanceCriteria": [
        "Each UFO has at least two white light sources (front + underside) that visibly illuminate cows when aimed toward them.",
        "The added lights create strong, readable contrast between the UFO body and the lit cow surfaces (no washed-out or imperceptible lighting).",
        "The added lights do not materially change the overall scene theme/palette beyond the requested white spotlights (existing neon/space style remains)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui/*) must not be edited.",
    "Keep all changes within the existing intro/hero scene; do not redesign the overall game theme or replace the scene wholesale."
  ],
  "nonGoals": [
    "Do not add new backend features or persistence for the intro scene.",
    "Do not introduce third-party physics engines or external runtime services.",
    "Do not add new authentication or multiplayer functionality."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}