{
  "kind": "build_request",
  "title": "Add animated starfield, deterministic spawns, timed UFO drops, boss timing, and intro chiptune loop (additive)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Render a black starfield background with randomly placed stars on the Play screen canvas as an additive visual layer (do not change the existing Spacecoco theme). The starfield should be subtly animated (e.g., gentle drift or twinkle) while keeping gameplay visuals readable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Agrega fondo negro con estrellas aleatorias.",
          "si a la segunda opción quiero que solo añadas los cambios sin cambiar nada de nuestra temática"
        ]
      },
      "acceptanceCriteria": [
        "When a match is running on /play, the canvas shows a black background with a random starfield.",
        "The starfield exhibits subtle animation (twinkle/drift) without distracting from or obscuring the snake/obstacles.",
        "No changes are made to global branding/theme outside the Play screen background rendering."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Update game initialization so the snake spawns centered on the grid with green color and an initial length of 5 blocks, while keeping the rest of the existing game theme and mechanics intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "La serpiente inicia en el centro de la pantalla, color verde, tamaño cinco bloques."
        ]
      },
      "acceptanceCriteria": [
        "On a new game start (including Play Again), the snake has 5 segments.",
        "The snake’s initial head position is centered on the grid (rounded to the nearest grid cell).",
        "The snake is rendered green at the start of the match."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Adjust obstacle spawning rules so that every 2 seconds a UFO descends from the top of the playfield carrying a cow inside, as an additive behavior (do not remove existing obstacle/power-up systems; integrate with them).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Cada dos segundos, un ovni baja desde arriba, con una vaca adentro.",
          "si a la segunda opción quiero que solo añadas los cambios sin cambiar nada de nuestra temática"
        ]
      },
      "acceptanceCriteria": [
        "During active gameplay (not paused/game-over), a new UFO spawn event occurs at a 2-second interval.",
        "Each spawned UFO originates above the visible playfield and moves downward into the playfield.",
        "Each UFO spawn includes a cow inside/associated with it (represented visually or as a coupled obstacle entity), consistent with existing cow mechanics."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Ensure the penguin boss spawn rule is enforced: every 5 levels, spawn a penguin boss in the center of the playfield (additive confirmation/adjustment that must not break other boss logic, including existing circling mechanics).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Cada cinco niveles, aparece un pingüino jefe en el centro.",
          "si a la segunda opción quiero que solo añadas los cambios sin cambiar nada de nuestra temática"
        ]
      },
      "acceptanceCriteria": [
        "When the player reaches levels 5, 10, 15, ... a penguin boss appears.",
        "The penguin boss spawns at the center of the playfield/grid.",
        "Existing penguin boss win/progress rules (circle 3 times) continue to work."
      ]
    },
    {
      "id": "REQ-21",
      "text": "At the start of each match, play a short looping chiptune background track at low volume. This must be additive: it must not remove or disable any existing dynamic/intensifying music behavior (if present); it should coexist or transition without regressing existing audio features.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Música chiptune espacial de fondo, loop corto, volumen bajo al empezar.”",
          "si a la segunda opción quiero que solo añadas los cambios sin cambiar nada de nuestra temática"
        ]
      },
      "acceptanceCriteria": [
        "When a match starts, a chiptune track begins playing automatically and loops.",
        "Initial playback volume is low by default.",
        "The existing mute/unmute UI on the Play screen continues to function for the match audio.",
        "No existing dynamic/intensifying/planet audio behavior is removed; if such behavior exists, it still triggers as before."
      ]
    }
  ],
  "constraints": [
    "Do not change the existing Spacecoco theme/branding; implement these items as additive gameplay/visual/audio tweaks only.",
    "All user-facing text must remain in English.",
    "Respect the existing frontend immutable paths and do not modify files under frontend/src/components/ui or the listed immutable hooks files."
  ],
  "nonGoals": [
    "Do not rebrand the app from Spacecoco to Serpentia in this change.",
    "Do not redesign the overall UI theme or navigation.",
    "Do not implement new backend game APIs or change backend canister state/schema as part of these additive gameplay tweaks."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}