{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Full-screen animated neon start cover image integration",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add the newly generated neon cover image as a static frontend asset in the public generated assets folder.",
      "acceptanceCriteria": [
        "A new image file exists at frontend/public/assets/generated/game-cover-neon-snake-ufo.dim_3840x2160.png.",
        "The image visually includes all key elements described by the user (snake + UFO split + alien, foreground smaller snakes with trails, flying cow with red lasers + smoke, rotating starfield feel, sparks/fire/explosive color, cinematic lighting/DOF).",
        "The asset is referenced via a plain static URL path starting with /assets/generated/ (no backend image serving)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/game-cover-neon-snake-ufo.dim_3840x2160.png",
          "operation": "create",
          "description": "Add the generated static cover image asset at the exact required path/filename so it can be served directly from frontend/public."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace the Play page pre-start overlay background with the new cover art and add subtle neon glow + motion animations while keeping the start UI readable and clickable.",
      "acceptanceCriteria": [
        "On /play when the game has not started yet, the user sees a full-viewport cover background using /assets/generated/game-cover-neon-snake-ufo.dim_3840x2160.png.",
        "The cover is animated (visible motion over time) and has a neon glow/shimmer effect; animation does not block button interactions.",
        "Existing start UI (title/description/start button) remains readable on top of the cover via an overlay/gradient/backdrop treatment.",
        "The previous start/cover background used in this state is no longer visible."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/start/NeonStartCoverOverlay.tsx",
          "operation": "create",
          "description": "Create a dedicated full-screen start overlay component that renders the new static cover image (from /assets/generated/game-cover-neon-snake-ufo.dim_3840x2160.png) as a fixed, viewport-filling background layer with subtle motion (parallax drift/zoom) and neon shimmer/glow effects, plus a readability overlay; ensure background layers do not intercept pointer events so buttons remain clickable."
        },
        {
          "path": "frontend/src/pages/PlayPage.tsx",
          "operation": "modify",
          "description": "Wire the new NeonStartCoverOverlay into the /play pre-start state (when isPlaying is false) to replace the existing plain dark overlay; ensure the overlay fills the viewport, keeps the existing title/description/start button readable, and does not block interactions; remove/avoid the old start background treatment in that state."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global utility classes and keyframes for the start-cover motion/glow (e.g., slow drift/zoom and hue-shift shimmer/light sweep) used by NeonStartCoverOverlay; keep animations subtle and performance-friendly."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update the Home page hero artwork to use the new cover image while preserving the responsive layout.",
      "acceptanceCriteria": [
        "frontend/src/pages/HomePage.tsx no longer references /assets/generated/spacecoco-hero-neon-cartoon.dim_1600x600.png.",
        "The Home page hero image displays /assets/generated/game-cover-neon-snake-ufo.dim_3840x2160.png and remains properly styled (no layout break on desktop)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Replace the hero <img> src to /assets/generated/game-cover-neon-snake-ufo.dim_3840x2160.png and adjust styling as needed (e.g., object-fit/size constraints) to maintain the existing desktop-responsive layout without breaking the grid."
        }
      ]
    }
  ]
}