{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Spacecoco Play screen: start game loop after sprite load, add load-failure fallback, and fix production asset paths",
  "requirements": [
    {
      "id": "REQ-29",
      "summary": "Ensure the requestAnimationFrame game loop starts reliably after sprites load and on resume, without stale React hook closures or missing-hook-dependency warnings.",
      "acceptanceCriteria": [
        "When navigating to /play from the Lobby, the canvas renders the starfield + snake within 1 second after assets load.",
        "The snake is always moving without requiring any user input.",
        "Pausing and resuming reliably restarts the animation loop and rendering (no freeze/blank screen after resume).",
        "There are no React console warnings about missing hook dependencies for the game loop start/resume logic."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/hooks/useGameLoop.ts",
          "operation": "modify",
          "description": "Refactor the animation loop start/resume flow to avoid stale closures: make the game loop function stable (or stored in a ref) and read sprite-load state from a ref so startGame()/resumeGame() always invoke a loop that sees the latest spritesLoaded value. Also ensure start/resume cancels any previous requestAnimationFrame before starting a new one, and ensure React hooks have correct dependencies to eliminate console warnings."
        },
        {
          "path": "frontend/src/pages/PlayPage.tsx",
          "operation": "modify",
          "description": "Update PlayPage’s effect that auto-starts the game after sprites load to include all required hook dependencies (e.g., include startGame in the dependency array) and avoid any start/resume logic that can capture stale values. Continue using existing shadcn-ui Button/Card components for UI structure; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Add a runtime fallback so Play is never fully blank if sprite loading fails: show an English error overlay and still render at least a minimal animated canvas (clear + starfield).",
      "acceptanceCriteria": [
        "If any sprite fails to load, the UI shows an overlay on the Play screen indicating that assets failed to load (English text) rather than leaving a blank screen.",
        "The failure state is logged to console with the underlying error.",
        "The user can still navigate back to the Lobby from the Play screen in the failure state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/hooks/useGameLoop.ts",
          "operation": "modify",
          "description": "Track sprite-loading failure state (e.g., an error value) when loadAllSprites() rejects, keep logging the underlying error to console, and ensure a minimal render loop still runs even without sprites (at minimum: clear + starfield render) so the canvas is never blank."
        },
        {
          "path": "frontend/src/pages/PlayPage.tsx",
          "operation": "modify",
          "description": "Add a user-visible error overlay for sprite load failure with an actionable English message (e.g., suggest refresh and/or checking connection) while preserving access to the existing “Back to Lobby” navigation. Continue using existing shadcn-ui Card/Button components for the overlay UI; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Verify and correct runtime sprite asset paths so sprite loading succeeds in production (IC canister hosting) for files under frontend/public/assets/generated.",
      "acceptanceCriteria": [
        "In production build, `loadAllSprites()` resolves successfully and `spritesLoaded` becomes true when the expected files exist under `/assets/generated/`.",
        "The “Loading Game Assets…” overlay disappears once sprites are loaded, and gameplay starts automatically.",
        "No 404s are emitted in the browser network panel for the sprite asset URLs referenced by the sprite loader."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/render/sprites.ts",
          "operation": "modify",
          "description": "Update sprite URL construction to be production-safe under IC canister hosting (e.g., resolve paths via the app base URL rather than assuming a leading-slash absolute path). Ensure the referenced filenames exactly match those in frontend/public/assets/generated (e.g., frontend/public/assets/generated/spacecoco-snake-sprites.dim_256x256.png, frontend/public/assets/generated/spacecoco-ufo.dim_64x64.png, frontend/public/assets/generated/spacecoco-cow.dim_64x64.png, frontend/public/assets/generated/spacecoco-penguin-boss.dim_128x128.png, frontend/public/assets/generated/spacecoco-crocodile-sprites.dim_256x128.png, frontend/public/assets/generated/spacecoco-laser-red.dim_64x16.png, frontend/public/assets/generated/spacecoco-explosion-pink-sprites.dim_256x256.png). Keep error reporting accurate so 404s are diagnosable."
        },
        {
          "path": "frontend/src/game/hooks/useGameLoop.ts",
          "operation": "modify",
          "description": "Align sprite-load state transitions with the corrected sprite paths so spritesLoaded reliably becomes true when assets exist, and ensure the game auto-start logic triggers rendering/movement once spritesLoaded flips true."
        },
        {
          "path": "frontend/src/pages/PlayPage.tsx",
          "operation": "modify",
          "description": "Ensure the “Loading Game Assets…” overlay is driven by the corrected sprite loading lifecycle so it disappears promptly after successful loads and gameplay starts automatically. Continue using existing shadcn-ui Card for the loading overlay; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}