{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Motor Snake 3D: Swap enemy primitives for textured 3D models with subtle per-enemy animation, scale tuning, and shadows",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace enemy primitive meshes (ufo/cow/crocodile/penguin) with locally hosted textured 3D models while keeping the existing 3D scene/camera/view intact.",
      "acceptanceCriteria": [
        "When enemies spawn, each of the four types renders as a 3D model (not the current sphere/box/cone/cylinder primitives).",
        "Enemy rendering changes are isolated to enemy visuals (e.g., EnemyEntity3D / model loading); the overall PlayPage + MotorSnakeGameRoot scene/camera setup remains unchanged.",
        "All required assets are stored as static files in the frontend (e.g., under frontend/public) and loaded at runtime (no backend involvement)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/models/enemies/ufo.glb",
          "operation": "create",
          "description": "Add a realistic textured UFO GLB model as a static asset to be loaded at runtime."
        },
        {
          "path": "frontend/public/assets/models/enemies/cow.glb",
          "operation": "create",
          "description": "Add a realistic textured cow GLB model as a static asset to be loaded at runtime."
        },
        {
          "path": "frontend/public/assets/models/enemies/crocodile.glb",
          "operation": "create",
          "description": "Add a realistic textured crocodile GLB model as a static asset to be loaded at runtime."
        },
        {
          "path": "frontend/public/assets/models/enemies/penguin.glb",
          "operation": "create",
          "description": "Add a realistic textured penguin GLB model as a static asset to be loaded at runtime."
        },
        {
          "path": "frontend/src/motorSnake3d/render/enemyModelCatalog.ts",
          "operation": "create",
          "description": "Create a small catalog mapping enemy.type to local GLB asset paths and per-type default transforms (scale/rotation offsets) for consistent loading and placement."
        },
        {
          "path": "frontend/src/motorSnake3d/render/useEnemyModelCache.ts",
          "operation": "create",
          "description": "Implement a lightweight GLB loader/cache utility for enemy models (shared across instances) that supports cloning scenes per enemy and exposes model+animation data."
        },
        {
          "path": "frontend/src/motorSnake3d/render/EnemiesLayer3D.tsx",
          "operation": "modify",
          "description": "Preload the four enemy GLB assets when the layer mounts to ensure enemies render as models immediately on spawn (avoid showing primitives as a fallback)."
        },
        {
          "path": "frontend/src/motorSnake3d/render/EnemyEntity3D.tsx",
          "operation": "modify",
          "description": "Replace primitive geometry rendering with per-enemy GLB scene instances loaded from the local static assets; keep existing positioning/hover/rotation behaviors but apply them to the model root instead of primitives."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add per-enemy visual styling and lightweight animation behaviors for the loaded 3D models (UFO blink, cow tail idle, crocodile look, penguin idle walk when near-stationary).",
      "acceptanceCriteria": [
        "UFO model uses a metallic-looking material response (metalness/roughness) and a visible blue emissive element that periodically blinks/pulses.",
        "Cow model includes a subtle, continuous tail animation (via GLB animation clip or bone/mesh transform) and retains existing hover motion if present.",
        "Crocodile model is clearly identifiable as a crocodile with green scaly look, open mouth, and visible white teeth.",
        "Penguin model is clearly identifiable (black/white body, orange beak) and shows a slow idle walk cycle when its in-game velocity is near zero.",
        "All animations run smoothly and do not introduce noticeable frame stutter on typical settings."
      ],
      "file_operations": [
        {
          "path": "frontend/src/motorSnake3d/render/enemyModelRigging.ts",
          "operation": "create",
          "description": "Add helper functions to locate important sub-objects (e.g., UFO emissive parts, cow tail bone/mesh) within loaded GLB scenes and to apply per-type material overrides (e.g., UFO metallic + emissive blue)."
        },
        {
          "path": "frontend/src/motorSnake3d/render/EnemyEntity3D.tsx",
          "operation": "modify",
          "description": "Add per-type animation handling: drive UFO emissive blinking/pulsing over time; use AnimationMixer clips when present (cow tail idle, penguin walk), and if clips are absent apply small bone/mesh transforms (e.g., tail swish) as a fallback; gate penguin walk cycle by enemy.velocity magnitude (near zero => idle walk)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Tune enemy model scale, depth, and subtle idle motion so models read well in perspective and match the existing world/snake proportions.",
      "acceptanceCriteria": [
        "Each enemy type appears at a reasonable, consistent size compared to the snake and does not clip excessively into the world sphere.",
        "Enemy models have visible 3D depth and a subtle rotation/idle motion that is perceptible during gameplay.",
        "No enemy model renders as an unlit flat-looking object (e.g., missing normals/lighting response)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/motorSnake3d/render/enemyModelCatalog.ts",
          "operation": "modify",
          "description": "Adjust per-enemy default scale and orientation offsets (and any pivot correction) so each model matches gameplay proportions relative to the player snake and world sphere."
        },
        {
          "path": "frontend/src/motorSnake3d/render/EnemyEntity3D.tsx",
          "operation": "modify",
          "description": "Apply a consistent model-root transform pipeline (position + tuned scale + subtle idle rotation/sway) without changing spawning/collision logic; ensure loaded meshes use lit materials (MeshStandardMaterial/physical) so they respond to scene lights."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Enable/adjust basic lighting and shadow casting/receiving for the new enemy models with performance safeguards and minimal scene impact.",
      "acceptanceCriteria": [
        "Enemy models are lit with scene lighting (not full-bright/unlit), and the scene includes shadow support that visibly improves model grounding (cast/receive where appropriate).",
        "Shadows/lighting changes do not significantly reduce performance (no obvious lag spikes attributable to model/shadow settings).",
        "If shadows must be limited for performance, the implementation uses reasonable quality safeguards (e.g., reduced shadow map size or selective shadow casting) while keeping a clear visual improvement."
      ],
      "file_operations": [
        {
          "path": "frontend/src/motorSnake3d/MotorSnakeGameRoot.tsx",
          "operation": "modify",
          "description": "Enable renderer shadow support on the existing Three.js canvas (e.g., Canvas shadows and conservative shadow settings) without altering camera/view composition."
        },
        {
          "path": "frontend/src/motorSnake3d/render/SphereWorld.tsx",
          "operation": "modify",
          "description": "Adjust lighting minimally so models are properly lit and grounded: ensure there is non-zero ambient fill, configure one primary light to cast shadows with performance-friendly shadow map settings, and set the world sphere material/mesh to receive shadows where appropriate."
        },
        {
          "path": "frontend/src/motorSnake3d/render/EnemyEntity3D.tsx",
          "operation": "modify",
          "description": "Configure loaded enemy model meshes to cast and receive shadows selectively (e.g., only the main body meshes cast) to improve grounding while avoiding performance regressions."
        }
      ]
    }
  ]
}