{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Smooth non-overlapping flying cows with UFO impulse pushes and spotlights in existing 3D hero scene",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Make all hero-scene cows drift smoothly in continuous motion across the visible area while maintaining non-overlap (no cow-vs-cow collisions) and preserving the existing neon/space look.",
      "acceptanceCriteria": [
        "Cows move with smooth, continuous motion across the visible intro scene area (no jittery/teleporting movement).",
        "Cows do not intersect/overlap each other during runtime (visual non-collision between cows).",
        "Existing intro scene theme/style remains intact (no broad color/theme redesign)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/start/heroDynamicsBus.ts",
          "operation": "create",
          "description": "Create a tiny in-memory shared state/bus for the hero 3D scene to exchange current cow positions and UFO positions between components (no backend, no persistence)."
        },
        {
          "path": "frontend/src/components/start/HeroAbductionChoreography3D.tsx",
          "operation": "modify",
          "description": "Replace static cow placement with a time-based, delta-stable steering update that: (1) maintains per-cow velocity, (2) wraps/clamps cows inside the hero camera-visible bounds, and (3) applies a separation steering force so cows never overlap (no cow-vs-cow collision response). Also publish current cow positions into the shared heroDynamicsBus each frame."
        },
        {
          "path": "frontend/src/components/start/HomeHeroThreeOverlay.tsx",
          "operation": "modify",
          "description": "Update the hero overlay wiring so VFX/other components reference the live cow positions from the shared heroDynamicsBus (instead of the current fixed cowPositions array), preserving the current scene composition."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add UFO dart/pass events that can impulsively push cows into new directions (UFO-only interactions), without enabling cow-vs-cow collision behavior.",
      "acceptanceCriteria": [
        "UFOs have occasional fast pass-through/dart motion events that bring them close enough to affect cows.",
        "When a UFO pass intersects a cow’s influence/collision radius, that cow’s trajectory changes immediately via an impulse-like push (direction and magnitude feel physical rather than scripted snapping).",
        "Cow-vs-cow interaction remains disabled (cows never push/bounce off each other)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/start/HeroUfoField3D.tsx",
          "operation": "modify",
          "description": "Add periodic dart/pass behavior to each background UFO (short bursts of high speed along a deterministic path), and publish each UFO’s world position (and optionally an instantaneous velocity estimate) into heroDynamicsBus each frame."
        },
        {
          "path": "frontend/src/components/start/HeroAbductionChoreography3D.tsx",
          "operation": "modify",
          "description": "Consume published UFO positions/velocity from heroDynamicsBus and implement UFO→cow impulse pushes when a UFO enters a cow influence radius: apply an impulse to the cow’s velocity (mass/damping tuned for a physical feel), while explicitly keeping cow-vs-cow collision responses disabled. Ensure the impulse logic is time-based (uses delta) and does not cause snapping/teleporting."
        },
        {
          "path": "frontend/src/components/start/heroDynamicsBus.ts",
          "operation": "modify",
          "description": "Extend the shared bus types/utilities as needed to support: (1) multiple UFO position feeds, (2) per-frame timestamps, and (3) reading live cow positions for aiming/interaction, keeping the module minimal and hero-scene-scoped."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add a stable ~3-second cadence cow ‘reaction’ behavior that layers on top of flight motion and UFO impulses.",
      "acceptanceCriteria": [
        "A clearly visible cow reaction animation/behavior triggers on an approximately 3-second cadence during the intro scene.",
        "Reactions do not break the cows’ smooth flight motion (they layer on top of the base movement).",
        "Reactions remain stable under varying frame rates (timing based on elapsed time, not frame count)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/start/HeroAbductionChoreography3D.tsx",
          "operation": "modify",
          "description": "Implement a reaction scheduler (elapsed-time based) that triggers approximately every 3 seconds (global or per-cow, but consistent), setting per-cow reaction parameters (e.g., reactionStartTime/intensity) on the cow group userData (or via the shared bus) without interrupting base movement/velocity integration."
        },
        {
          "path": "frontend/src/components/start/HeroFlyingCowPBR.tsx",
          "operation": "modify",
          "description": "Layer a visible secondary reaction animation on top of the existing smooth flight pose updates by reading reaction state (e.g., from groupRef.userData): add temporary wobbles/roll/pitch exaggeration, tail flick, or brief squash/stretch with eased decay. Ensure reaction timing uses elapsed time and composes with existing abduction intensity behavior."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add high-contrast white front and underside lights for each UFO, oriented toward nearby cows, producing clean readable 3D contrast without changing the scene’s existing neon/space theme.",
      "acceptanceCriteria": [
        "Each UFO has at least two white light sources (front + underside) that visibly illuminate cows when aimed toward them.",
        "The added lights create strong, readable contrast between the UFO body and the lit cow surfaces (no washed-out or imperceptible lighting).",
        "The added lights do not materially change the overall scene theme/palette beyond the requested white spotlights (existing neon/space style remains)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/start/HeroUfoField3D.tsx",
          "operation": "modify",
          "description": "Add two white lights per background UFO (front + underside). Update their transforms each frame to stay attached to the UFO and aim toward a nearby cow target derived from heroDynamicsBus cow positions (e.g., nearest cow or centroid), tuning intensity/angle/distance for high-contrast illumination without washing out existing neon accents."
        },
        {
          "path": "frontend/src/components/start/HeroAbductionChoreography3D.tsx",
          "operation": "modify",
          "description": "Add two white lights (front + underside) to the choreographed UFO group. Each frame, aim them toward an appropriate cow target (nearest cow and/or currently abducted cow) and tune for strong, readable contrast on cow PBR materials while keeping the existing theme intact."
        },
        {
          "path": "frontend/src/components/start/HomeHeroThreeOverlay.tsx",
          "operation": "modify",
          "description": "Adjust only hero-scene-local lighting composition if needed (e.g., minor intensity balancing) so the new UFO white spotlights read clearly against the UFO body and cows, without broad palette/theme changes."
        }
      ]
    }
  ]
}