{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Play screen audio unlock, focus-safe 60fps loop, 4K-crisp DPR canvas, and upgraded toon silhouettes/textures",
  "requirements": [
    {
      "id": "REQ-48",
      "summary": "Initialize AudioContext immediately on Play mount and unlock/start audio via user gesture on mobile while preserving mute toggle behavior.",
      "acceptanceCriteria": [
        "When the Play screen mounts, an AudioContext is created (or prepared) immediately, but actual playback only starts after a user gesture if required by the platform/browser.",
        "Toggling mute always silences music and SFX immediately and reliably, including on mobile where audio requires a user gesture to begin.",
        "No audio-start logic is executed from a per-frame render loop; audio start/stop is triggered by lifecycle/state transitions (e.g., start/resume/pause/mute) rather than every frame."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/audio/useAudioContextMusic.ts",
          "operation": "modify",
          "description": "Create/prepare the AudioContext at hook initialization time (on mount) and add explicit user-gesture unlock support (e.g., resume) so playback start is driven by Play lifecycle/state transitions rather than any frame loop."
        },
        {
          "path": "frontend/src/game/audio/useAudioContextSfx.ts",
          "operation": "modify",
          "description": "Add an explicit ‘prepare/init’ API to create the AudioContext immediately (without playing), and ensure mute immediately stops/avoids starting any active oscillators/sources."
        },
        {
          "path": "frontend/src/pages/PlayPage.tsx",
          "operation": "modify",
          "description": "Wire early audio preparation on Play mount and add a one-time user gesture handler (pointer/touch/keyboard) that unlocks audio contexts on mobile while keeping the existing mute toggle semantics intact."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Run a single focus-safe RAF loop targeting 60fps and pause/resume cleanly on visibility/focus changes without duplicated loops or blank renders.",
      "acceptanceCriteria": [
        "The Play screen runs updates/renders via requestAnimationFrame with a 60fps target (where the browser allows).",
        "On document visibility change (hidden) and/or window blur, the game loop stops (no accumulating RAF callbacks), and on visibility/focus return it resumes cleanly.",
        "After multiple hide/show cycles, there is still exactly one active RAF loop and gameplay continues from the same paused/unpaused state as intended (no speedup, no freeze, no blank canvas)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/hooks/useGameLoop.ts",
          "operation": "modify",
          "description": "Refactor the RAF driver into explicit start/stop controls to guarantee exactly one active loop; add visibilitychange + blur/focus handling to stop the loop when hidden/unfocused and resume it safely (without spawning duplicate RAF callbacks), keeping state-consistent pause/resume behavior."
        },
        {
          "path": "frontend/src/pages/PlayPage.tsx",
          "operation": "modify",
          "description": "Ensure Play UI pause/resume controls integrate with the updated loop start/stop behavior (no duplicated loops across pause and focus cycles) and that a render occurs after resume to avoid any perceived blank canvas."
        }
      ]
    },
    {
      "id": "REQ-50",
      "summary": "Implement DPR-scaled (clamped) canvas backing resolution for crisp 4K/high-DPI rendering and apply correct image smoothing for toon primitives vs bitmap textures/sprites.",
      "acceptanceCriteria": [
        "On high-DPI displays, the canvas backing resolution scales with devicePixelRatio (with an upper clamp so performance stays stable), while CSS size remains consistent.",
        "Toon/vector-style primitives remain smooth (no jagged edges) at high DPI.",
        "If any bitmap textures/sprite images are rendered, the appropriate image smoothing setting is applied so they are not blurred unintentionally.",
        "The visual result is measurably sharper than a non-DPR-scaled canvas (text and outlines are crisp, no ‘soft’ look)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/render/canvasDpr.ts",
          "operation": "create",
          "description": "Add a small utility to size the canvas backing store using devicePixelRatio with a clamp (e.g., max 2), keep CSS size stable, and provide a consistent drawing transform/setup for crisp high-DPI rendering."
        },
        {
          "path": "frontend/src/pages/PlayPage.tsx",
          "operation": "modify",
          "description": "Apply DPR-aware canvas sizing on mount and on resize using the new canvas DPR utility so the displayed size stays consistent while the backing resolution is scaled/clamped for crisp 4K rendering."
        },
        {
          "path": "frontend/src/game/hooks/useGameLoop.ts",
          "operation": "modify",
          "description": "Update draw initialization to respect DPR-scaled canvas sizing (logical vs backing dimensions) so the starfield and toon renderer render sharply and consistently after resizes."
        },
        {
          "path": "frontend/src/game/render/toonRenderer.ts",
          "operation": "modify",
          "description": "Ensure toon/vector primitives keep high-quality smoothing enabled by default, and provide a safe way for callers to temporarily toggle smoothing when drawing bitmap/pixel assets as needed."
        },
        {
          "path": "frontend/src/game/render/sprites.ts",
          "operation": "modify",
          "description": "When drawing any legacy bitmap sprites, temporarily set canvas image smoothing appropriately (typically disabled for pixel art) to prevent unintended blur on high-DPI canvases."
        }
      ]
    },
    {
      "id": "REQ-51",
      "summary": "Upgrade penguin boss, UFO, and alien/pilot visuals to readable silhouettes with clear toon details while preserving existing renderer style and gameplay.",
      "acceptanceCriteria": [
        "Penguin boss rendering is updated so it reads clearly as a penguin (distinct head/body separation, beak/eyes/flippers silhouette cues) rather than a single circle entity.",
        "UFO rendering is updated so it reads clearly as a spacecraft (distinct hull/dome/lights cues) rather than a plain ellipse, while preserving the existing glow treatment and drift motion.",
        "Alien presence is represented visually (e.g., an alien pilot visible in/near the UFO or as a distinct rendered feature) using original artwork (no third-party copyrighted characters).",
        "Entities remain readable over the starfield and VFX; silhouettes are recognizable at typical gameplay zoom.",
        "All user-facing UI text remains in English (no new Spanish UI text introduced)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/render/obstacles.ts",
          "operation": "modify",
          "description": "Replace the current generic UFO and penguin boss drawing with clearer multi-part silhouettes (hull+dome+lights for UFO; head/body/beak/eyes/flippers cues for penguin) while preserving existing glow treatment, drift motion, and gameplay hit rules."
        },
        {
          "path": "frontend/src/game/render/toonMaterials.ts",
          "operation": "modify",
          "description": "Extend toon texture accessors/material definitions to support UFO decals/emissive accents and an alien pilot visual element used by the improved UFO rendering, with safe null fallbacks."
        },
        {
          "path": "frontend/src/game/render/toonRenderer.ts",
          "operation": "modify",
          "description": "Add/adjust renderer helpers as needed to support drawing layered toon shapes plus optional texture overlays (e.g., decals/pilot) while keeping the overall Spacecoco toon style consistent."
        }
      ]
    },
    {
      "id": "REQ-52",
      "summary": "Add new 4K toon textures and wire them into the existing toon texture loader/rendering pipeline with resilient fallbacks (no blank screen if load fails).",
      "acceptanceCriteria": [
        "New/updated textures are added under frontend/public/assets/generated and load successfully via the existing texture loader paths used at runtime.",
        "If textures fail to load, the game still renders (fallback rendering remains functional) and the Play screen is never fully blank.",
        "No backend image serving is introduced; all new art is shipped as static frontend assets."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/ufo-toon-albedo-v2.dim_4096x4096.png",
          "operation": "create",
          "description": "Add the generated toon UFO exterior albedo texture asset at frontend/public/assets/generated/ufo-toon-albedo-v2.dim_4096x4096.png and ensure it is included in the build output."
        },
        {
          "path": "frontend/public/assets/generated/penguin-toon-albedo-v2.dim_4096x4096.png",
          "operation": "create",
          "description": "Add the generated toon penguin boss albedo texture asset at frontend/public/assets/generated/penguin-toon-albedo-v2.dim_4096x4096.png and ensure it is included in the build output."
        },
        {
          "path": "frontend/public/assets/generated/alien-pilot-toon-albedo.dim_4096x4096.png",
          "operation": "create",
          "description": "Add the generated toon alien pilot texture asset at frontend/public/assets/generated/alien-pilot-toon-albedo.dim_4096x4096.png and ensure it is included in the build output."
        },
        {
          "path": "frontend/public/assets/generated/ufo-decals-emissive.dim_2048x2048.png",
          "operation": "create",
          "description": "Add the generated toon emissive decal sheet asset at frontend/public/assets/generated/ufo-decals-emissive.dim_2048x2048.png and ensure it is included in the build output."
        },
        {
          "path": "frontend/src/game/render/toonMaterials.ts",
          "operation": "modify",
          "description": "Update the toon texture loader to load the new assets from frontend/public/assets/generated/ufo-toon-albedo-v2.dim_4096x4096.png, frontend/public/assets/generated/penguin-toon-albedo-v2.dim_4096x4096.png, frontend/public/assets/generated/alien-pilot-toon-albedo.dim_4096x4096.png, and frontend/public/assets/generated/ufo-decals-emissive.dim_2048x2048.png; keep robust error handling so rendering falls back to shape-only drawing if any texture fails."
        },
        {
          "path": "frontend/src/game/render/obstacles.ts",
          "operation": "modify",
          "description": "Wire the new textures into the UFO/penguin rendering paths (using safe null checks and existing shape fallbacks) so the Play screen never becomes blank if assets fail to load."
        }
      ]
    }
  ]
}